Revit 2026 API

# BuiltInFailuresStructuralAssetFailures Class

---

Failures related to structural materials.

SystemObject Autodesk.Revit.DBBuiltInFailuresStructuralAssetFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralAssetFailures
```
```vb
Public NotInheritable Class StructuralAssetFailures
```
```cpp
public ref class StructuralAssetFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralAssetFailures = class end
```

The BuiltInFailuresStructuralAssetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialAssetInvalid | Material assigned to the Analytical Element does not contain Structure parameters - verify material content. |

#### Reference

Autodesk.Revit.DB Namespace